#include <stdio.h>

/*Задача 2. Напишете функцията int atof(char *s), която
преобразува стринг в число с десетична запетая. Тази функция е
подобна на разглежданата по-горе atoi(char *s), само че когато се
стигне до . точката, отделяща цялата част от дробната, трябва
да се пусне още един цикъл, който да изчисли числото в
дробната част по същия начин, както е числото в цялата част.
Само че тук при дробната част трябва да имаме една
променлива, която да умножаваме по 10 всеки път до края на
дробната част power *= 10; Накрая трябва да разделим
полученото число на тази променлива, за да получим реалното
число с плаващата заперая на точното място. */

/*Упражнение 3.* Добавете проверка във функцията int atof(char
*s) дали подаденият стринг няма показни позиции преди числото
и, ако има, ги премахнете. Проверете дали числото не е
отрицателно и, ако е така, включете знака в резултата.*/

float atof(char *s);

int main(void){

    char s[] = "-1aaa23.654da32";
    printf("%f",atof(s));

    return 0;
}

float atof(char s[]){

    char flagMinus = 1, flagDot = 0;
    float rez = 0, calcDot=1;
    if (s[0] == '-'){
        flagMinus = -flagMinus;
    }
    int i = 0;
    while (s[i] != '\0')
    {
        if (s[i] == '.'){
            flagDot = 1;
            i++;
            continue;
        }
        if(s[i]<'0'||s[i]>'9'){
            i++;
            continue;
        }else{
            if(flagDot){
                calcDot/=10;
                rez +=(s[i]-'0')*calcDot;
            }else{
                rez=rez*10+(s[i]-'0');
            }
        }
        i++;
    }
    return rez*flagMinus;
}
