#include <stdio.h>

/*Задача 7. Дефинирайте масив int с 10 елемента. Дефинирайте
пойнтер, който ще сочи към масива. Насочете пойнтера към масива. Нужно
ли е да използвате &? Какво представлява името на масива? Какво сочи?
Колко начина има за да изпишете насочването на пойнтера към масива.
Има ли разлика между тях?*/

int main(void){

    int n[10]={1,2,3,4,5,6,7,8,9,10};
    int *pn = NULL;
    pn=n;
    printf("%d\n",pn[3]);
    pn=&n[5];
    printf("%d\n",pn[3]);

    return 0;
}