#include <stdio.h>

/*Задача 4.Напишете функцията int binarySearch(int a[], int n, int
x), която получава като първи аргумент началото на масив а,
втория аргумент е дължината на масива, а третия аргумент е
числото, което търсим. Знаем, че масива в който ще търсим
елемента е предварително подреден. Сравняваме тъсения
елемент с елемента в средата на масива. Ако той е по голям от
този в средата търсим елемента от средата до края, ако е помалък го търсим в частта от началото до средата. Това се
повтаря, докато елемента от масива не стане равен с търсения.
Тогава връщаме номера на който се намира елемента в масива
или -1 ако не се съдържа в масива.*/

int binarySearch(int a[], int l, int x);

int main(void){

    int a[]={1,2,3,4,5};
    printf("%d",binarySearch(a,5,5));

    return 0;
}

int binarySearch(int a[], int l, int x){
    int start=0,end=l;

    while(end-start>1){
        int i=start+(end-start)/2;
        if(a[i]==x){
            return i;
        }else if(a[i]<x){
            start=i;
        }else{
            end=i;
        }
    }
    return -1;
    
}