#include <stdio.h>

/*Задача 1. Напишете програма, която сумира всички елементи на масив
намиращи се на четна позиция:
int arr[10] = {23, 91, 36, 4, 9, 99, 87, 11, 2, 33};
Декларирайте пойнтер към първата нечетна позиция, инкрементирайте
пойнтера по подходящ начин, за да извършите сумирането.*/

int sumArr(int *a,int n);


int main(void){

    int arr[11] = {23, 91, 36, 4, 9, 99, 87, 11, 2, 33,111};
    int *p=&arr[1];
    printf("%d",sumArr(p,11));
    return 0;
}

int sumArr(int *a,int n){
    int rez=0;
    int *p = a+n;
    while(a<p){
        rez+=*(a-1);
        a+=2;
    }

    return rez;
}