#include <stdio.h>

/*Задача 6.
Дефинирайте променлива „а“, дeфинирайте пойнтер към
нея, присвоете му адреса на променливата. През пойнтера
задайте нова стойност = 5 на променливата „а“. Каква е
стойността на “а”?*/

int main(void){

    int a=14;
    int *iP=&a;
    printf("%d\n",a);
    *iP=5;
    printf("%d",a);

    return 0;
}