#include <stdio.h>

/*Задача 7.
Направете програма, в която инициализирате пойнтер към
променлива и след това изчислявате сбор на променливата
(използвайки пойнтера) + 5. Отпечатайте на екрана.*/

int main(void){

    int a=12;
    int *iP=&a;
    printf("%d\n",a);
    *iP+=5;
    printf("%d",a);

    return 0;
}