#include <stdio.h>

/*Задача 10.
Как работи? Дефинираме променлива “а“, дефинираме
пойнтер, но още не му задаваме стойност. Отпечатайте
адреса на “а”. След това присвояваме стойност на
пойнтера, като внимаваме типовете на пойнтера и
променливата да са от един и същи тип. Отпечатваме
на екрана стойността на пойнтера с %р, стойността на
„а“ с %d, стойността на *ptr с %d.*/

int main(void){

    int a=12;
    int *iP;
    printf("%p\n",&a);
    iP=&a;
    printf("%p\n",iP);
    printf("%d\n",a);
    printf("%d",*iP);


    return 0;
}