#include <stdio.h>

/*Задача 11.
Напишете програма, която умножава 2 числа, като
използва пойнтер-и.
Пойнтер-ите не са страшни. Дефинират се като
тип *Х и се използват като *Х. Както променливите,
но със * отпред (и 1 наум!).
Продължение: Опитайте да умножите 2 променливи от
различен тип, използвайки пойнтери.*/

int main(void){

    int a=15;
    int b=3;
    int *aP=&a;
    int *bP=&b;
    char c = 'a';
    char *cP=&c;

    printf("%d\n",*aP * *bP);

    printf("%d\n",*aP * *cP);
    return 0;
}