#include <stdio.h>

/*Задача 9. Дефинирайте и инициализирайте променлива „а“.
Пойнтер към пойнтер към променлива.
Дефинирайте и инициализирайте пойнтер към нея.
Дефинирайте и инициализирайте пойнтер към първия пойнтер. Задайте
стойност на втория пойнтер 15.
Колко е стойността на променливата „а“?
Вземете бележката от масата, на нея пише в кое чекмедже (на скрина)
ще намерите бележката, на която пише къде е палтото (в гардероба);
Обърнете внимание на броя на звездичките!*/

int main(void){

    int a=2;
    int *iP=&a;
    int **iPP=&iP;

    printf("%d\n",a);
    **iPP=15;
    printf("%d\n",a);
    printf("%p\n",iP);
    printf("%p\n",&iP);
    printf("%p",iPP);

    return 0;
}